import { useTranslation } from "react-i18next";
import { useTheme } from "@emotion/react";
import { v4 as uuidv4 } from "uuid";
import Dhekr from "./dhekr";
import "../App.css";

// MUI Components
import ToggleButtonGroup from "@mui/material/ToggleButtonGroup";
import ToggleButton from "@mui/material/ToggleButton";

// React
import { useState, useEffect, useMemo } from "react";

export default function Adhkar() {
  const theme = useTheme();
  const { t } = useTranslation();
  const morningDhekr = useMemo(
    () => [
      {
        id: uuidv4(),
        count: 1,
        text: "﴿ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "أصبحنا على فطرة الإسلام وكلِمة الإخلاص، ودين نبينا محمد صلى الله عليه وسلم، ومِلَّةِ أبينا إبراهيم، حنيفاً مسلماً، وما كان من المشركين",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبياً",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "يا حيُّ يا قيوم برحمتك أستغيثُ، أصلح لي شأني كله، ولا تَكلني إلى نفسي طَرْفَةَ عين أبدًا",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدُك, وأنا على عهدِك ووعدِك ما استطعتُ، أعوذ بك من شر ما صنعتُ، أبوءُ لَكَ بنعمتكَ عَلَيَّ، وأبوء بذنبي، فاغفر لي، فإنه لا يغفرُ الذنوب إلا أنت",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت, أعوذ بك من شرّ نفسي، ومن شرّ الشيطان وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم",
      },
      {
        id: uuidv4(),
        count: 1,
        text: " أصبحنا وأصبح الملك لله، والحمد لله ولا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، أسألك خير ما في هذا اليوم، وخير ما بعده، وأعوذ بك من شر هذا اليوم، وشر ما بعده، وأعوذ بك من الكسل وسوء الكبر، وأعوذ بك من عذاب النار وعذاب القبر",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، واحفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بك أن أغتال من تحتي",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)",
      },
      {
        id: uuidv4(),
        count: 7,
        text: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
      },
      {
        id: uuidv4(),
        count: 4,
        text: "اللهم إني أصبحت، أُشهدك وأُشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله، وحدك لا شريك لك وأن محمداً عبدك ورسولك",
      },
      {
        id: uuidv4(),
        count: 10,
        text: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو على كل شيء قدير",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "سبحان الله وبحمده",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "أستغفر الله",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "سبحان الله، والحمد لله، والله أكبر, لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهوعلى كل شيء قدير",
      },
    ],
    []
  );

  const eveningDhekr = useMemo(
    () => [
      {
        id: uuidv4(),
        count: 1,
        text: "﴿ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "أمسينا على فطرة الإسلام وكلِمة الإخلاص، ودين نبينا محمد صلى الله عليه وسلم، ومِلَّةِ أبينا إبراهيم، حنيفاً مسلماً، وما كان من المشركين",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبياً",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم بك أمسينا, وبك أصبحنا، وبك نحيا، وبك نموت، وإليك النشور",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "يا حيُّ يا قيوم برحمتك أستغيثُ، أصلح لي شأني كله، ولا تَكلني إلى نفسي طَرْفَةَ عين أبدًا",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدُك, وأنا على عهدِك ووعدِك ما استطعتُ، أعوذ بك من شر ما صنعتُ، أبوءُ لَكَ بنعمتكَ عَلَيَّ، وأبوء بذنبي، فاغفر لي، فإنه لا يغفرُ الذنوب إلا أنت",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت, أعوذ بك من شرّ نفسي، ومن شرّ الشيطان وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم",
      },
      {
        id: uuidv4(),
        count: 1,
        text: " أمسينا وأمسى الملك لله، والحمد لله ولا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، أسألك خير ما في هذه الليلة, وخير ما بعدها، وأعوذ بك من شر هذه الليلة, وشر ما بعدها، وأعوذ بك من الكسل وسوء الكبر، وأعوذ بك من عذاب النار وعذاب القبر",
      },
      {
        id: uuidv4(),
        count: 1,
        text: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، واحفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بك أن أغتال من تحتي",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
      },
      {
        id: uuidv4(),
        count: 3,
        text: "بسم الله الرحمن الرحيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)",
      },
      {
        id: uuidv4(),
        count: 7,
        text: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
      },
      {
        id: uuidv4(),
        count: 4,
        text: "اللهم إني أمسيت, أُشهدك وأُشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله، وحدك لا شريك لك وأن محمداً عبدك ورسولك",
      },
      {
        id: uuidv4(),
        count: 10,
        text: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو على كل شيء قدير",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "سبحان الله وبحمده",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "أستغفر الله",
      },
      {
        id: uuidv4(),
        count: 100,
        text: "سبحان الله، والحمد لله، والله أكبر, لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهوعلى كل شيء قدير",
      },
    ],
    []
  );

  let [dhekr, setDhekr] = useState(morningDhekr);
  const [alignment, setAlignment] = useState("أذكار الصباح");

  useEffect(() => {
    if (alignment === "أذكار الصباح") {
      setDhekr(morningDhekr);
    } else if (alignment === "أذكار المساء") {
      setDhekr(eveningDhekr);
    }
  }, [alignment, eveningDhekr, morningDhekr]);
  const adhkar = dhekr.map((element) => {
    return <Dhekr key={element.id} element={element} />;
  });
  return (
    <div
      style={{
        background: theme.palette.background.paper,
        paddingBlock: "30px",
      }}
    >
      <div className="title" style={{ color: "theme.primary" }}>
        <h2 style={{ color: theme.primary }}>{t("Adhkar")}</h2>
      </div>
      <h4 style={{ fontWeight: "600", marginBottom: "10px" }}>
        {t("Fortress of the Muslim")}
      </h4>
      <ToggleButtonGroup
        color="secondary"
        value={alignment}
        exclusive
        aria-label="Platform"
        dir="ltr"
      >
        <ToggleButton
          onClick={() => {
            setAlignment("أذكار الصباح");
          }}
          value="أذكار الصباح"
          sx={{ color: "primary.main" }}
        >
          {t("Morning Adhkar")}
        </ToggleButton>
        <ToggleButton
          onClick={() => {
            setAlignment("أذكار المساء");
          }}
          value="أذكار المساء"
          sx={{ color: "primary.main" }}
        >
          {t("Evening Adhkar")}
        </ToggleButton>
      </ToggleButtonGroup>
      <div
        style={{
          display: "flex",
          flexWrap: "wrap",
          justifyContent: "space-around",
          gap: "20px",
          padding: "20px",
        }}
      >
        {adhkar}
      </div>
    </div>
  );
}
